org/_posts/2016-10-14-favourite-quotes-einstein.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "Einstein 1879 - 1955"
date: 2016-10-14
comments: true
quotes: true
tags: quotes
excerpt: Favourite quotes from Einstein
---
#+END_HTML

- Intellectual growth should commence at birth and cease only at death


- There are two ways to live; you can live as if nothing is a miracle;
  or you can live as if everything is a miracle


- Logic will get from A to B. Imagination will take you everywhere


- If you can't explain it simply, you don't understand it well enough


- The only real valuable thing is intuition


- The world is not dangerous because of those who harm but because of
  those who look at it without doing anything


- Learn from yesterday, live for today, hope for tomorrow. The
  important thing is not stop questioning


- I have no particular talent. I have simply unsatisfied curiosity


- You have to learn the rules of the game. And then you have to play
  better than anyone else


- If the facts don't fit the theory. Change the facts


- Force always attracts men of low morality


- Any man who read too much and uses his own brain too little falls
  into lazy habits of thinking


- Pure mathematics is, in its way, the poetry of logical is
