_posts/2016-10-14-favourite-quotes-einstein.html
---
layout: post
title: "Einstein 1879 - 1955"
date: 2016-10-14
comments: true
quotes: true
tags: quotes
excerpt: Favourite quotes from Einstein
---

<ul class="org-ul">
<li>Intellectual growth should commence at birth and cease only at death</li>

<li>There are two ways to live; you can live as if nothing is a miracle;
or you can live as if everything is a miracle</li>

<li>Logic will get from A to B. Imagination will take you everywhere</li>

<li>If you can't explain it simply, you don't understand it well enough</li>

<li>The only real valuable thing is intuition</li>

<li>The world is not dangerous because of those who harm but because of
those who look at it without doing anything</li>

<li>Learn from yesterday, live for today, hope for tomorrow. The
important thing is not stop questioning</li>

<li>I have no particular talent. I have simply unsatisfied curiosity</li>

<li>You have to learn the rules of the game. And then you have to play
better than anyone else</li>

<li>If the facts don't fit the theory. Change the facts</li>

<li>Force always attracts men of low morality</li>

<li>Any man who read too much and uses his own brain too little falls
into lazy habits of thinking</li>

<li>Pure mathematics is, in its way, the poetry of logical is</li>
</ul>
